"""测试十六进制/八进制常量的正确处理。
由于 PEP 237 带来的变化，这个问题比较复杂。
"""
导入 unittest

类 测试十六八二进制(unittest.TestCase):
    定义 test_十六进制_基线(自身):
        # 一些大小写测试
        自身.assertEqual(0x0, 0X0)
        自身.assertEqual(0x1, 0X1)
        自身.assertEqual(0x123456789abcdef, 0X123456789abcdef)
        # 基线测试
        自身.assertEqual(0x0, 0)
        自身.assertEqual(0x10, 16)
        自身.assertEqual(0x7fffffff, 2147483647)
        自身.assertEqual(0x7fffffffffffffff, 9223372036854775807)
        # 带减号并且有括号
        自身.assertEqual(-(0x0), 0)
        自身.assertEqual(-(0x10), -16)
        自身.assertEqual(-(0x7fffffff), -2147483647)
        自身.assertEqual(-(0x7fffffffffffffff), -9223372036854775807)
        # 带减号但没有括号
        自身.assertEqual(-0x0, 0)
        自身.assertEqual(-0x10, -16)
        自身.assertEqual(-0x7fffffff, -2147483647)
        自身.assertEqual(-0x7fffffffffffffff, -9223372036854775807)

    定义 test_十六进制_无符号(自身):
        # 正常的正数常量
        自身.assertEqual(0x80000000, 2147483648)
        自身.assertEqual(0xffffffff, 4294967295)
        # 带减号并且有括号
        自身.assertEqual(-(0x80000000), -2147483648)
        自身.assertEqual(-(0xffffffff), -4294967295)
        # 带减号但没有括号
        # 在 Python 2.2 到 2.2.2 以及 2.3a1 中这里是失败的
        自身.assertEqual(-0x80000000, -2147483648)
        自身.assertEqual(-0xffffffff, -4294967295)
        # 正数常量
        自身.assertEqual(0x8000000000000000, 9223372036854775808)
        自身.assertEqual(0xffffffffffffffff, 18446744073709551615)
        # 带减号并且有括号
        自身.assertEqual(-(0x8000000000000000), -9223372036854775808)
        自身.assertEqual(-(0xffffffffffffffff), -18446744073709551615)
        # 带减号但没有括号
        # 在 Python 2.2 到 2.2.2 以及 2.3a1 中这里是失败的
        自身.assertEqual(-0x8000000000000000, -9223372036854775808)
        自身.assertEqual(-0xffffffffffffffff, -18446744073709551615)

    定义 test_八进制_基线(自身):
        # 一些大小写测试
        自身.assertEqual(0o0, 0O0)
        自身.assertEqual(0o1, 0O1)
        自身.assertEqual(0o1234567, 0O1234567)
        # 基线测试
        自身.assertEqual(0o0, 0)
        自身.assertEqual(0o20, 16)
        自身.assertEqual(0o17777777777, 2147483647)
        自身.assertEqual(0o777777777777777777777, 9223372036854775807)
        # 带减号并且有括号
        自身.assertEqual(-(0o0), 0)
        自身.assertEqual(-(0o20), -16)
        自身.assertEqual(-(0o17777777777), -2147483647)
        自身.assertEqual(-(0o777777777777777777777), -9223372036854775807)
        # 带减号但没有括号
        自身.assertEqual(-0o0, 0)
        自身.assertEqual(-0o20, -16)
        自身.assertEqual(-0o17777777777, -2147483647)
        自身.assertEqual(-0o777777777777777777777, -9223372036854775807)

    定义 test_八进制_无符号(自身):
        # 正数常量
        自身.assertEqual(0o20000000000, 2147483648)
        自身.assertEqual(0o37777777777, 4294967295)
        # 带减号并且有括号
        自身.assertEqual(-(0o20000000000), -2147483648)
        自身.assertEqual(-(0o37777777777), -4294967295)
        # 带减号但没有括号
        # 在 Python 2.2 到 2.2.2 以及 2.3a1 中这里是失败的
        自身.assertEqual(-0o20000000000, -2147483648)
        自身.assertEqual(-0o37777777777, -4294967295)
        # 正数常量
        自身.assertEqual(0o1000000000000000000000, 9223372036854775808)
        自身.assertEqual(0o1777777777777777777777, 18446744073709551615)
        # 带减号并且有括号
        自身.assertEqual(-(0o1000000000000000000000), -9223372036854775808)
        自身.assertEqual(-(0o1777777777777777777777), -18446744073709551615)
        # 带减号但没有括号
        # 在 Python 2.2 到 2.2.2 以及 2.3a1 中这里是失败的
        自身.assertEqual(-0o1000000000000000000000, -9223372036854775808)
        自身.assertEqual(-0o1777777777777777777777, -18446744073709551615)

    定义 test_二进制_基线(自身):
        # 一些大小写测试
        自身.assertEqual(0b0, 0B0)
        自身.assertEqual(0b1, 0B1)
        自身.assertEqual(0b10101010101, 0B10101010101)
        # 基线测试
        自身.assertEqual(0b0, 0)
        自身.assertEqual(0b10000, 16)
        自身.assertEqual(0b1111111111111111111111111111111, 2147483647)
        自身.assertEqual(
            0b111111111111111111111111111111111111111111111111111111111111111,
            9223372036854775807
        )
        # 带减号并且有括号
        自身.assertEqual(-(0b0), 0)
        自身.assertEqual(-(0b10000), -16)
        自身.assertEqual(-(0b1111111111111111111111111111111), -2147483647)
        自身.assertEqual(
            -(0b111111111111111111111111111111111111111111111111111111111111111),
            -9223372036854775807
        )
        # 带减号但没有括号
        自身.assertEqual(-0b0, 0)
        自身.assertEqual(-0b10000, -16)
        自身.assertEqual(-0b1111111111111111111111111111111, -2147483647)
        自身.assertEqual(
            -0b111111111111111111111111111111111111111111111111111111111111111,
            -9223372036854775807
        )

    定义 test_二进制_无符号(自身):
        # 正数常量
        自身.assertEqual(0b10000000000000000000000000000000, 2147483648)
        自身.assertEqual(0b11111111111111111111111111111111, 4294967295)
        # 带减号并且有括号
        自身.assertEqual(-(0b10000000000000000000000000000000), -2147483648)
        自身.assertEqual(-(0b11111111111111111111111111111111), -4294967295)
        # 带减号但没有括号
        # 在 Python 2.2 到 2.2.2 以及 2.3a1 中这里是失败的
        自身.assertEqual(-0b10000000000000000000000000000000, -2147483648)
        自身.assertEqual(-0b11111111111111111111111111111111, -4294967295)
        # 正数常量
        自身.assertEqual(
            0b1000000000000000000000000000000000000000000000000000000000000000,
            9223372036854775808
        )
        自身.assertEqual(
            0b1111111111111111111111111111111111111111111111111111111111111111,
            18446744073709551615
        )
        # 带减号并且有括号
        自身.assertEqual(
            -(0b1000000000000000000000000000000000000000000000000000000000000000),
            -9223372036854775808
        )
        自身.assertEqual(
            -(0b1111111111111111111111111111111111111111111111111111111111111111),
            -18446744073709551615
        )
        # 带减号但没有括号
        # 在 Python 2.2 到 2.2.2 以及 2.3a1 中这里是失败的
        自身.assertEqual(
            -0b1000000000000000000000000000000000000000000000000000000000000000,
            -9223372036854775808
        )
        自身.assertEqual(
            -0b1111111111111111111111111111111111111111111111111111111111111111,
            -18446744073709551615
        )

如果 __name__ == "__main__":
    unittest.main()

